#Задание 1
age =  int(input("введите ваш возраст: "))
age1 = int(input("введите возраст вашего друга: "))
print ("сумма ваших возрастов: " ,age + age1)

#Задание 2
name = input("введите ваше имя: ")
surname = input("введите вашу фамилию: ")
print (f"привет, {name} {surname}!")

#Задание 3
menu = "Куриный суп\nПюре\nБорщ"
print(menu)

#Задание 4
print("***\n***\n***\n")

#Задание 5
x = int(input("число: "))
print(x-3,x-2,x-1)
print(x)
print(x+3,x+2,x+1)
